Repository: ItsmePatrice/Discreta
Catalog: discreta/lib/l10n/app_*.arb
Languages: fr

# noInternetTitle
source: No Internet connection
fr: Pas de connexion Internet

# noInternetConnection
source: Please verify your Internet connection and try again.
fr: Veuillez vérifier votre connexion Internet et réessayer.

source: Retry
fr: Réessayer

# slogan
source: Safety in complete discretion
fr: La sécurité, en toute discretion

# brandMessage
source: One gesture. One alert. Reliable support, in complete discretion.
fr: Un geste. Une alerte. Un soutien fiable, en toute discrétion.

source: Sign in with Google
fr: Se connecter avec Google

source: Sign in error
fr: Erreur de connexion

# signInErrorMessage
source: We couldnâ€™t complete your sign in. Please try again.
fr: Nous n’avons pas pu compléter la connexion. Veuillez réessayer.

source: Sign in failed
fr: Échec de la connexion

# signInFailedMessage
source: An unexpected error occurred. Please check your Internet connection or try again later.
fr: Une erreur inattendue est survenue. Veuillez réessayer plus tard ou vérifier votre connexion Internet.

source: Home
fr: Accueil

source: Profile
fr: Profil

# greeting
source: Hello
fr: Bonjour

# discretaWelcomeMessage
source: You're not alone.
fr: Vous n'êtes pas seule.

# discretaReassuranceMessage
source: Discreta is quietly watching.
fr: Discreta veille discrètement.

# connected
source: bracelet connected
fr: bracelet connecté

# notConnected
source: bracelet not connected
fr: bracelet non connecté

source: Safety timer
fr: Minuteur de sécurité

source: Start
fr: Démarrer

source: Stop
fr: Arrêter

# alertIn
source: Your contacts will be alerted in
fr: Vos contacts seront alertés dans

# contactsAndAlert
source: Contacts & Alert
fr: Contacts & Alerte

source: Alert message
fr: Message d'alerte

# alertMessagePlaceholder
source: Type your alert message here ...
fr: Écrire votre message d'alerte ici...

source: Add contact
fr: Ajouter un contact

# maxContactMessage
source: You can only add up to 5 contacts.
fr: Vous pouvez ajouter un maximum de 10 contacts

source: Name
fr: Nom

source: Phone number
fr: Numéro de téléphone

source: Cancel
fr: Annuler

source: Add
fr: Ajouter

source: Edit Contact
fr: Modifier le contact

source: Save
fr: Sauvegarder

# invalidPhoneNumberMessage
source: Please enter a valid 10-digit number.
fr: Veuillez entrer un numéro valide à 10 chiffres.

source: Sign out
fr: Se déconnecter

source: Settings
fr: Paramètres

source: Unknown error
fr: Erreur inconnu

source: language
fr: langue

source: Time before automatic alert
fr: Durée avant alerte automatique

source: Success
fr: Succès

source: Alert message saved.
fr: Message d'alerte enregistré.

# confirmDeleteContact
source: Are you sure you want to delete this contact?
fr: Êtes-vous sûr de vouloir supprimer ce contact?

source: Yes
fr: Oui

source: No
fr: Non

source: How to use Discreta
fr: Comment utiliser Discreta

# step1
source: Hold the bracelet's power button for 3 seconds to turn it on.
fr: Maintenez le bouton d’alimentation du bracelet pendant 3 secondes pour l’allumer.

# step2
source: Tap the bracelet's power button 3 times to turn on pairing mode.
fr: Appuyez 3 fois sur le bouton d’alimentation du bracelet pour activer le mode d’appairage.

# step2Observations
source: You should see a blue light blinking under the bracelet.
fr: Vous devriez voir une lumière bleue clignoter sous le bracelet.

# step3
source: Connect your phone to the bracelet trough bluetooth.
fr: Connectez votre téléphone au bracelet via Bluetooth.

# step3Observations
source: The light should turn back to green and you will see the bracelet status as connected on the Home page.
fr: La lumière devrait redevenir verte et le statut du bracelet apparaîtra comme connecté sur la page d’accueil.

# step4
source: Add you alert message and your trusted contacts on the Contacts tab.
fr: Ajoutez votre message d’alerte et vos contacts de confiance dans l’onglet Contacts.

# step6
source: Double tap the power button on the bracelet to send an alert immediately.
fr: Appuyez deux fois sur le bouton d’alimentation du bracelet pour envoyer une alerte immédiatement.

# step6Observation
source: Your contacts should receive your alert message with your real-time location, and the bracelet should vibrate on your wrist as a sign of confirmation. Don't forget to confirm your safety on the Home tab.
fr: Vos contacts devraient recevoir votre message d’alerte avec votre position en temps réel, et le bracelet devrait vibrer sur votre poignet comme signe de confirmation. N’oubliez pas de confirmer votre sécurité dans l’onglet Accueil.

# step7
source: Make sure that your phone is always connected to the internet while using the bracelet.
fr: Assurez-vous que votre téléphone est toujours connecté à Internet lorsque vous utilisez le bracelet.

# step8
source: Hold the power button for 3 seconds to switch off the bracelet.
fr: Maintenez le bouton d’alimentation pendant 3 secondes pour éteindre le bracelet.

# step9
source: You're good to go.
fr: Vous êtes prête.

source: Power & Setup
fr: Allumage et configuration

source: Pairing & Connection
fr: Appairage et connexion

source: Safety & Alerts
fr: Sécurité et alertes

source: Send alert
fr: Envoyer une alerte

# alertSent
source: Alert has been sent.
fr: L'alerte a été envoyée.

# confirmSendAlert
source: Are you sure you want to send an alert to your contacts?
fr: Êtes-vous sûr de vouloir envoyer une alerte?

# alertNoSent
source: The alert wasn't sent. Please make sure you have at least 1 saved contact.
fr: L’alerte n’a pas été envoyée. Ajoutez au moins un contact pour continuer.

source: Error
fr: Erreur

source: Location required
fr: Localisation requise

# locationAccessReason
source: Discreta requires access to your location to share your real-time position with trusted contacts in case of danger.
fr: Discreta a besoin d’accéder à votre position afin de partager votre localisation en temps réel avec vos contacts de confiance en cas de danger.

# noLocationConsequence
source: Without location access, Discreta cannot function.
fr: Sans l’accès à la localisation, Discreta ne peut pas fonctionner.

source: Enable Location
fr: Activer la localisation
